tap "homebrew/bundle"
tap "xcodesorg/made"

# dev tools
brew "gh"
brew "jq"
brew "libyaml"
brew "mint"
brew "nvm"
brew "rbenv"
brew "the_silver_searcher"
brew "java"
brew "poetry"
brew "pyenv"

# productivity apps
cask "1password"
cask "notion"
cask "raycast"
cask "shottr"

# dev apps
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
cask "xcodes"
vscode "sswg.swift-lang"
vscode "vadimcn.vscode-lldb"
