# run "brew bundle dump" to generate a similar file when chaning macs
# NOTE: comment out extra stuff before running "brew bundle install" in a new mac

# taps are the sources to look for
# tap "chargepoint/xcparse"
tap "homebrew/bundle"
# tap "simonbs/dependency-graph", "https://github.com/simonbs/dependency-graph.git"
tap "xcodesorg/made"

# dev tools
# brew "ffmpeg"
brew "gh"
# brew "graphviz"
brew "jq"
brew "libyaml"
brew "mint"
brew "nvm"
brew "pyenv"
brew "rbenv"
brew "the_silver_searcher"
# brew "chargepoint/xcparse/xcparse"
# brew "simonbs/dependency-graph/dependency-graph"

# productivity apps
cask "1password"
# cask "charles"
# cask "gitbutler"
cask "notion"
# cask "proxyman"
cask "raycast"
cask "shottr"
cask "shottr"
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
# cask "wireshark" # network protocol analayzer - not sure why I installed it
cask "xcodes"

# dev apps
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
cask "xcodes"

# vs code extensions
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gtp-dx.dx-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "sswg.swift-lang"
vscode "tintinweb.graphviz-interactive-preview"
vscode "vadimcn.vscode-lldb"
